---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.#ctor
source: html/83ec5569-bbab-eb7e-f53c-89b176329cee.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.#ctor Method

Constructs color settings object with default colors.

## Syntax (C#)
```csharp
public PointCloudColorSettings()
```